/* automatically generated by rust-bindgen 0.69.4 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;

#[doc = "< don't convert binary data to text"]
pub const zbar_config_e_ZBAR_CFG_BINARY: zbar_config_e = 4;
#[doc = "< number of boolean decoder configs"]
pub const zbar_config_e_ZBAR_CFG_NUM: zbar_config_e = 5;
#[doc = "< minimum data length for valid decode"]
pub const zbar_config_e_ZBAR_CFG_MIN_LEN: zbar_config_e = 32;
#[doc = "< maximum data length for valid decode"]
pub const zbar_config_e_ZBAR_CFG_MAX_LEN: zbar_config_e = 33;
#[doc = "< required video consistency frames"]
pub const zbar_config_e_ZBAR_CFG_UNCERTAINTY: zbar_config_e = 64;
#[doc = "< enable scanner to collect position data"]
pub const zbar_config_e_ZBAR_CFG_POSITION: zbar_config_e = 128;
#[doc = "< if fails to decode, test inverted"]
pub const zbar_config_e_ZBAR_CFG_TEST_INVERTED: zbar_config_e = 129;
#[doc = "< image scanner vertical scan density"]
pub const zbar_config_e_ZBAR_CFG_X_DENSITY: zbar_config_e = 256;
#[doc = "< image scanner horizontal scan density"]
pub const zbar_config_e_ZBAR_CFG_Y_DENSITY: zbar_config_e = 257;
#[doc = " decoder configuration options.\n @since 0.4"]
pub type zbar_config_e = ::std::os::raw::c_int;
#[doc = " decoder configuration options.\n @since 0.4"]
pub use self::zbar_config_e as zbar_config_t;
#[doc = " barcode tagged as GS1 (EAN.UCC) reserved\n (eg, FNC1 before first data character).\n data may be parsed as a sequence of GS1 AIs"]
pub const zbar_modifier_e_ZBAR_MOD_GS1: zbar_modifier_e = 0;
#[doc = " barcode tagged as AIM reserved\n (eg, FNC1 after first character or digit pair)"]
pub const zbar_modifier_e_ZBAR_MOD_AIM: zbar_modifier_e = 1;
#[doc = " number of modifiers"]
pub const zbar_modifier_e_ZBAR_MOD_NUM: zbar_modifier_e = 2;
#[doc = " decoder symbology modifier flags.\n @since 0.11"]
pub type zbar_modifier_e = ::std::os::raw::c_int;
#[doc = " decoder symbology modifier flags.\n @since 0.11"]
pub use self::zbar_modifier_e as zbar_modifier_t;
pub const video_control_type_e_VIDEO_CNTL_INTEGER: video_control_type_e = 1;
pub const video_control_type_e_VIDEO_CNTL_MENU: video_control_type_e = 2;
pub const video_control_type_e_VIDEO_CNTL_BUTTON: video_control_type_e = 3;
pub const video_control_type_e_VIDEO_CNTL_INTEGER64: video_control_type_e = 4;
pub const video_control_type_e_VIDEO_CNTL_STRING: video_control_type_e = 5;
pub const video_control_type_e_VIDEO_CNTL_BOOLEAN: video_control_type_e = 6;
pub type video_control_type_e = ::std::os::raw::c_int;
pub use self::video_control_type_e as video_control_type_t;
#[doc = " store video control menu\n @param name name of the menu item\n @param val integer value associated with the item"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct video_control_menu_s {
    pub name: *mut ::std::os::raw::c_char,
    pub value: i64,
}
#[test]
fn bindgen_test_layout_video_control_menu_s() {
    const UNINIT: ::std::mem::MaybeUninit<video_control_menu_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<video_control_menu_s>(),
        16usize,
        concat!("Size of: ", stringify!(video_control_menu_s))
    );
    assert_eq!(
        ::std::mem::align_of::<video_control_menu_s>(),
        8usize,
        concat!("Alignment of ", stringify!(video_control_menu_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(video_control_menu_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(video_control_menu_s),
            "::",
            stringify!(value)
        )
    );
}
#[doc = " store video control menu\n @param name name of the menu item\n @param val integer value associated with the item"]
pub type video_control_menu_t = video_control_menu_s;
#[doc = " store video controls\n @param name name of the control\n @param group name of the control group/class\n @param type type of the control\n @param min minimum value of control (if control is integer)\n @param max maximum value of control (if control is integer)\n @param def default value of control (if control is integer)\n @param step increment steps (if control is integer)\n @param menu menu array\n @param menu_size menu size\n @since 0.20"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct video_controls_s {
    pub name: *mut ::std::os::raw::c_char,
    pub group: *mut ::std::os::raw::c_char,
    pub type_: video_control_type_t,
    pub min: i64,
    pub max: i64,
    pub def: i64,
    pub step: u64,
    pub menu_size: ::std::os::raw::c_uint,
    pub menu: *mut video_control_menu_t,
    pub next: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_video_controls_s() {
    const UNINIT: ::std::mem::MaybeUninit<video_controls_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<video_controls_s>(),
        80usize,
        concat!("Size of: ", stringify!(video_controls_s))
    );
    assert_eq!(
        ::std::mem::align_of::<video_controls_s>(),
        8usize,
        concat!("Alignment of ", stringify!(video_controls_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).def) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(def)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(step)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menu_size) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(menu_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).menu) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(menu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(video_controls_s),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " store video controls\n @param name name of the control\n @param group name of the control group/class\n @param type type of the control\n @param min minimum value of control (if control is integer)\n @param max maximum value of control (if control is integer)\n @param def default value of control (if control is integer)\n @param step increment steps (if control is integer)\n @param menu menu array\n @param menu_size menu size\n @since 0.20"]
pub type video_controls_t = video_controls_s;
#[doc = " store a video resolution\n @param width width of the video window\n @param height length of the video window\n @param max_fps maximum streaming speed, in frames per second\n @since 0.22"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct video_resolution_s {
    pub width: ::std::os::raw::c_uint,
    pub height: ::std::os::raw::c_uint,
    pub max_fps: f32,
}
#[test]
fn bindgen_test_layout_video_resolution_s() {
    const UNINIT: ::std::mem::MaybeUninit<video_resolution_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<video_resolution_s>(),
        12usize,
        concat!("Size of: ", stringify!(video_resolution_s))
    );
    assert_eq!(
        ::std::mem::align_of::<video_resolution_s>(),
        4usize,
        concat!("Alignment of ", stringify!(video_resolution_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(video_resolution_s),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(video_resolution_s),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_fps) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(video_resolution_s),
            "::",
            stringify!(max_fps)
        )
    );
}
extern "C" {
    #[doc = " retrieve runtime library version information.\n @param major set to the running major version (unless NULL)\n @param minor set to the running minor version (unless NULL)\n @returns 0"]
    pub fn zbar_version(
        major: *mut ::std::os::raw::c_uint,
        minor: *mut ::std::os::raw::c_uint,
        patch: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " set global library debug level.\n @param verbosity desired debug level.  higher values create more spew"]
    pub fn zbar_set_verbosity(verbosity: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " increase global library debug level.\n eg, for -vvvv"]
    pub fn zbar_increase_verbosity();
}
extern "C" {
